In [40]:
import pandas as pd
data = {
    'Student': ['Idrees','Saufi','Faiz','Dila','Nadirah'],
    'Math': [99, 85, 95, 85, 98],
    'English': [45, 35, 25, 65, 59],
    'Science': [55, 65, 75, 85, 87],
}

df = pd.DataFrame(data)

### Aggregation, Grouping, Filtering

- Aggregation Methods in `Pandas`:
    - can apply aggregations on series objects
    - `['mean','max','min', 'count', 'sum', 'std', 'var','prod']`
    - std - standard deviation
    - var - variance
    - prod - product
    - 
    - `series.agg([cols])` - multiple aggregations on the same column

In [41]:
# aggregation - combine stuff to get some metrics
df.English.mean() # can apply 


df['Math'].mean()

df.Science.count() # how many rows there are in a column
df.Science.value_counts()

Science
55    1
65    1
75    1
85    1
87    1
Name: count, dtype: int64

In [42]:
# multiple aggregations on the SAME column

df.Science.agg(['mean','max','min', 'count', 'sum', 'std', 'var','prod'])

mean     7.340000e+01
max      8.700000e+01
min      5.500000e+01
count    5.000000e+00
sum      3.670000e+02
std      1.352036e+01
var      1.828000e+02
prod     1.982784e+09
Name: Science, dtype: float64

In [43]:
# aggregations for MULTIPLE columns

df[['Math','English','Science']].mean()
df[['Math','English','Science']].sum()
df[['Math','English','Science']].min()
df[['Math','English','Science']].max()
df[['Math','English','Science']].count()
df[['Math','English','Science']].value_counts()

Math  English  Science
99    45       55         1
85    35       65         1
95    25       75         1
85    65       85         1
98    59       87         1
Name: count, dtype: int64

## Grouping in pandas
- `df.groupby(  'Catagory'   ) [ ' Column1','column2','column3'  ]  . aggregation() `
- Example:
    - 
    - multi_grouping = df.groupby('Category')['Value'].agg(['sum', 'mean', 'min', 'max'])

In [44]:
df

   Student  Math  English  Science
0   Idrees    99       45       55
1    Saufi    85       35       65
2     Faiz    95       25       75
3     Dila    85       65       85
4  Nadirah    98       59       87

In [45]:
# category
df.groupby('Student').head()

   Student  Math  English  Science
0   Idrees    99       45       55
1    Saufi    85       35       65
2     Faiz    95       25       75
3     Dila    85       65       85
4  Nadirah    98       59       87

We keep some catagories in data

In [68]:
data = {
    'Student': ['Idrees','Saufi','Faiz','Dila','Nadirah'],
    'Liscence': ['Yes', 'No', 'Yes', 'No', 'No'],
    'Age': [30, 30, 30, 18, 18],
    'F_subject': ['Science', 'Science', 'English','Physics', 'Physics']
}

df_a = pd.DataFrame(data)

In [ ]:
# aggregates for a category
df_a.groupby('F_subject')['Age'].sum() 

df_a.groupby('Student')['F_subject'].count()

Student
Dila       1
Faiz       1
Idrees     1
Nadirah    1
Saufi      1
Name: F_subject, dtype: int64

In [48]:
df_a

   Student Liscence  Age Favourite_subject
0   Idrees      Yes   30           Science
1    Saufi       No   30           Science
2     Faiz      Yes   30           English
3     Dila       No   18           Physics
4  Nadirah       No   18           Physics

## Filtering in pandas
-

In [47]:
['id', 'user_name', 'user_email', 'order_2023_01', 'order_2023_02', 'order_2023_03', 'total_spent', 'is_member', 'discount_code', 'latitude', 'longitude']

['id',
 'user_name',
 'user_email',
 'order_2023_01',
 'order_2023_02',
 'order_2023_03',
 'total_spent',
 'is_member',
 'discount_code',
 'latitude',
 'longitude']